# 测试题：
# 01.对于下面这行代码：如果用户键入12，answer会是什么数据类型？是字符串还是数字？
# 02.如何让input()打印一条提示消息？
# 03.如何使用input()得到一个整数？
# 04.如何使用input()得到一个浮点数（小数）？

# --------------------------------------------------------------------------------
print("hello world!")
# 动手试一试
# 01.在交互模式中创建两个变量，分别表示你的姓氏和名字。然后使用一条print()语句，把它们打印在一起。
# 02.编写一个程序，先问你的姓氏，再问你的名字，然后打印出一条消息，其中包含你的姓名。
# 03.编写一个程序，询问一间矩形房间的尺寸（单位是米），然后计算并显示铺满整个房间总共需要多少地毯，单位是平方米。
# 04.编写一个程序，完成第3题的要求，并且询问每平方尺地毯的价格。然后主程序显示下面3项内容。· 总共需要多少地毯，单位是平方米。· 总共需要多少地毯，单位是平方尺（1平方米=9平方尺）。· 地毯的总价格。
# 05.编写一个程序，帮助用户统计一些零钱。程序要问下面的问题。· “有多少枚1分”· “有多少枚1角？”· “有多少枚1元？”让程序给出这些零钱的总值（单位是元）。